<a href="https://colab.research.google.com/github/supriyaohdar/Data-Scientist-Salary/blob/main/DataScientistsSalary.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Data Scientists Salary

#Importing libraries

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings('ignore')

#Loading datasets

In [ ]:
#from google.colab import files
#uploaded= files.upload()

#Reading datasets

In [ ]:

traindata=pd.read_csv("Final_Train_Dataset.csv")
testdata=pd.read_csv("Final_Test_Dataset.csv")

In [ ]:
traindata.head(20)

    Unnamed: 0 experience  ...  salary company_name_encoded
0            0    5-7 yrs  ...   6to10                 3687
1            1  10-17 yrs  ...  10to15                  458
2            2    5-9 yrs  ...  15to25                 4195
3            3   7-10 yrs  ...  10to15                  313
4            4    1-3 yrs  ...    3to6                 1305
5            5   5-10 yrs  ...   6to10                 4428
6            6  13-15 yrs  ...  25to50                 1988
7            7   6-10 yrs  ...   6to10                 1793
8            8    1-3 yrs  ...    0to3                 3398
9            9    2-6 yrs  ...  15to25                 3444
10          10    3-7 yrs  ...   6to10                 3492
11          11  10-12 yrs  ...  10to15                 1969
12          12    2-6 yrs  ...  10to15                 3692
13          13    2-4 yrs  ...   6to10                 4479
14          14    1-6 yrs  ...  10to15                 2127
15          15    3-6 yrs  ...  10to15                 2914
16          16    5-8 yrs  ...   6to10                 3998
17          17    3-6 yrs  ...  10to15                 1548
18          18    4-9 yrs  ...  15to25                 2401
19          19    3-5 yrs  ...   6to10                 4554

[20 rows x 9 columns]

In [ ]:
testdata

     experience  ... company_name_encoded
0      7-12 yrs  ...                 2066
1       0-5 yrs  ...                 2629
2       3-6 yrs  ...                 2448
3       0-3 yrs  ...                 2711
4       0-5 yrs  ...                   40
...         ...  ...                  ...
6596    4-7 yrs  ...                 2692
6597    1-5 yrs  ...                  104
6598   5-10 yrs  ...                 2025
6599   7-12 yrs  ...                 2512
6600    3-8 yrs  ...                  464

[6601 rows x 7 columns]

#Exploratory Data Analysis

In [ ]:
traindata.shape

(19802, 9)

In [ ]:
testdata.shape

(6601, 7)

In [ ]:
traindata.dtypes

Unnamed: 0               int64
experience              object
job_description         object
job_desig               object
job_type                object
key_skills              object
location                object
salary                  object
company_name_encoded     int64
dtype: object

In [ ]:
testdata.dtypes

experience              object
job_description         object
job_desig               object
job_type                object
key_skills              object
location                object
company_name_encoded     int64
dtype: object

In [ ]:
traindata.describe(include='all')

          Unnamed: 0 experience  ...  salary company_name_encoded
count   19802.000000      19802  ...   19802         19802.000000
unique           NaN        129  ...       6                  NaN
top              NaN   5-10 yrs  ...  10to15                  NaN
freq             NaN       1274  ...    4500                  NaN
mean     9900.500000        NaN  ...     NaN          2379.723866
std      5716.489351        NaN  ...     NaN          1475.342341
min         0.000000        NaN  ...     NaN             0.000000
25%      4950.250000        NaN  ...     NaN          1067.000000
50%      9900.500000        NaN  ...     NaN          2225.000000
75%     14850.750000        NaN  ...     NaN          3621.000000
max     19801.000000        NaN  ...     NaN          5034.000000

[11 rows x 9 columns]

In [ ]:
testdata.describe(include='all')

       experience  ... company_name_encoded
count        6601  ...          6601.000000
unique        110  ...                  NaN
top      5-10 yrs  ...                  NaN
freq          419  ...                  NaN
mean          NaN  ...          1319.330707
std           NaN  ...           808.158350
min           NaN  ...             0.000000
25%           NaN  ...           611.000000
50%           NaN  ...          1250.000000
75%           NaN  ...          2025.000000
max           NaN  ...          2751.000000

[11 rows x 7 columns]

In [ ]:
traindata['experience1'] = traindata['experience'].str.split('-').str[0]
traindata['experience2'] = traindata['experience'].str.split('-').str[1].str.replace('yrs','')

In [ ]:
traindata['s1'] = traindata['salary'].str.split('to').str[0]
traindata['s2'] = traindata['salary'].str.split('to').str[1]

In [ ]:
traindata.drop(columns=['Unnamed: 0','salary','job_desig','key_skills','experience','job_description','job_type','location'],inplace=True)

In [ ]:
traindata

       company_name_encoded experience1 experience2  s1  s2
0                      3687           5          7    6  10
1                       458          10         17   10  15
2                      4195           5          9   15  25
3                       313           7         10   10  15
4                      1305           1          3    3   6
...                     ...         ...         ...  ..  ..
19797                  2245          12         18   15  25
19798                  4966           0          3    0   3
19799                  4272           8         13   15  25
19800                  1793           1          3   10  15
19801                  1349           2          5   10  15

[19802 rows x 5 columns]

In [ ]:
traindata['company_name_encoded']=traindata['company_name_encoded'].astype('int64')
traindata['experience1']=traindata['experience1'].astype('int64')
traindata['experience2']=traindata['experience2'].astype('int64')
traindata['s1']=traindata['s1'].astype('int64')
traindata['s2']=traindata['s2'].astype('int64')

In [ ]:
traindata.dtypes

company_name_encoded    int64
experience1             int64
experience2             int64
s1                      int64
s2                      int64
dtype: object

In [ ]:
testdata['experience1'] = testdata['experience'].str.split('-').str[0]
testdata['experience2'] = testdata['experience'].str.split('-').str[1].str.replace('yrs','')

In [ ]:
testdata.drop(columns=['experience','job_description','job_desig','job_type','key_skills','location'],inplace=True)

In [ ]:
testdata

      company_name_encoded experience1 experience2
0                     2066           7         12
1                     2629           0          5
2                     2448           3          6
3                     2711           0          3
4                       40           0          5
...                    ...         ...         ...
6596                  2692           4          7
6597                   104           1          5
6598                  2025           5         10
6599                  2512           7         12
6600                   464           3          8

[6601 rows x 3 columns]

#Splitting the data

In [ ]:
from sklearn.model_selection import train_test_split
array = traindata.values
X = array[:, 0:5]

Y = array[:, 4]

x_train, x_valid, y_train, y_valid = train_test_split(X, Y, test_size=0.20, random_state=1)

#Build the model

Logistic Regression

In [ ]:
from sklearn.linear_model import LogisticRegression

model = LogisticRegression()

model.fit(x_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [ ]:
predictions = model.predict(x_valid)

In [ ]:
from sklearn.metrics import mean_absolute_error

error= mean_absolute_error(y_valid, predictions)
error

5.275687957586468

In [ ]:
accuracy = model.score(x_valid, y_valid)
accuracy*100

49.83590002524615

K-Fold Cross validition

In [ ]:

from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score

# Test options and evaluation metric
num_folds = 10
seed = 7
scoring = 'accuracy'

kfold = KFold(n_splits=num_folds, random_state=seed)
cv_results = cross_val_score(model, x_train, y_train, scoring=scoring, cv=kfold)
msg = '%f (%f)'%(cv_results.mean(), cv_results.std())
print(msg)

0.485829 (0.007398)

SVM

In [ ]:
from sklearn.svm import SVC

model2 = SVC()
model2.fit(x_train, y_train)

SVC(C=1.0, break_ties=False, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='scale', kernel='rbf',
    max_iter=-1, probability=False, random_state=None, shrinking=True,
    tol=0.001, verbose=False)

In [ ]:
predictions2=model2.predict(x_valid)

array([15, 25, 25, ...,  3, 15, 10])